<script>
  import { basket as basketPopupStore } from '../store/popups.js';

  let titleName = 'Заголовок, который меняется через props'

  export {
    titleName
  }
</script>

<div class="header">
  <h1 class="header__title">{ titleName}</h1>
  <button class="header__backet" on:click={() => (basketPopupStore.update(state => !state)) }>
    <span class="header__backet-text">
      Корзина
    </span>
    <span class="header__basket-icon">
       <svg class="header__basket-svg" width="24" height="30" viewBox="50 0 410 500">
        <path d="M420.8 211.761l-290.2-.051-12.164-41.877c-1.813-6.242-6.839-11.175-13.116-12.873l-42.57-11.513c-1.604-.432-3.253-.652-4.902-.652-8.448 0-15.89 5.702-18.098 13.863-1.308 4.835-.653 9.894 1.842 14.237 2.495 4.344 6.532 7.457 11.368 8.764l32.395 8.76 65.766 237.212c-9.368 4.621-15.441 14.199-15.441 24.861 0 15.291 12.44 27.732 27.732 27.732s27.733-12.441 27.733-27.732c0-.361-.007-.721-.021-1.08h133.879c-.016.359-.021.719-.021 1.08 0 15.291 12.439 27.732 27.731 27.732s27.733-12.441 27.733-27.732c0-14.055-10.687-25.838-24.36-27.52-33.275-5.375-169.084-11.941-169.084-11.941l-4.461-17.455H351.99c8.663 0 16.366-5.822 18.732-14.156l36.619-128.996H420.8c11.229 0 20.33-9.105 20.33-20.333.002-11.228-9.1-20.33-20.33-20.33zM204.969 352.408h-31.764c-.868-.017-2.143.184-2.725-1.859-.737-2.594-1.772-6.159-1.772-6.159l-24.893-87.692c-.122-.426-.034-.895.233-1.248.269-.356.694-.569 1.14-.569h38.604c.672 0 1.245.459 1.391 1.116l21.055 94.279.076.289c.04.131.06.271.06.416.001.778-.628 1.415-1.405 1.427zm81.061-95.791l-17.156 94.676c-.146.656-.719 1.115-1.392 1.115h-23.958c-.675 0-1.247-.459-1.395-1.117l-17.155-94.676c-.095-.422.007-.859.28-1.201.271-.34.678-.535 1.112-.535h58.27c.437 0 .84.195 1.114.537.273.34.374.777.28 1.201zm81.159.08l-26.876 94.672c-.173.611-.738 1.039-1.372 1.039h-32.87c-.437 0-.841-.195-1.113-.533-.272-.342-.374-.781-.279-1.205l21.142-94.674c.144-.647.729-1.117 1.394-1.117h38.604c.444 0 .87.213 1.137.568.265.355.353.823.233 1.25z"/>
        <path class="header__basket-icon-arrow" d="M253.147 185.853c3.932 6.797 14.071 6.78 17.988-.012l49.671-74.677c1.997-3.468 1.81-7.883-.481-11.159-2.173-3.107-5.54-4.42-9.223-4.416-3.642.002-7.284.002-10.924.004l-17.239.013V20.84c0-11.511-9.331-20.84-20.843-20.84-11.511 0-20.842 9.329-20.842 20.84v74.791l-12.877.009-16.022.013c-7.839.002-12.917 8.777-8.983 15.587l49.775 74.613z"/>
      </svg>
    </span>
  </button>
</div>

<style lang="scss">
.header {
  display: flex;
}

.header__backet {
  display: flex;
  margin-left: auto;
  width: 250px;

  align-items: center;

  position: relative;

  background-color: transparent;
  border-radius: 3px;

  cursor: pointer;

  &:hover .header__backet-text{
    width: 50%;
  }
}

.header__backet-text {
  width: 0;
  margin-left: auto;

  transition: width 0.3s;

  overflow: hidden;
}

.header__basket-icon  {
  margin-right: auto;

  box-shadow: -5px 0 20px 10px #ffffff;

  background-color: transparent;
}

.header__basket-icon-arrow {
  opacity: 0;

  transition: opacity 0.3s;

  &_show {
    opacity: 1;
  }
}
</style>
